<?php

namespace Database\Seeders;

use App\Modules\Company\Models\CompanyActivity;
use App\Modules\Customer\Models\DoctorType;
use Illuminate\Database\Seeder;

class DoctorTypeSeeder extends Seeder
{

    /**
     * @var string[]
     */
    protected $doctorTypes = [
        'ალერგოლოგია-იმუნოლოგია',
        'ბავშვთა ალერგოლოგია-იმუნოლოგია',
        'ანგიოლოგია',
        'კარდიოლოგია',
        'კარდიოქირურგია',
        'სისხლძარღვთა ქირურგია',
        'ანესთეზიოლოგია',
        'ანესთეზიოლოგია-რეანიმატოლოგია',
        'ანესთეზიოლოგია და რეანიმატოლოგია',
        'გადაუდებელი მედიცინა',
        'კრიტიკულ მდგომარეობათა მედიცინა (კრიტიკული მედიცინა; კრიტიკული მედიცინა, ინტენსიური თერაპია)',
        'ბავშვთა გადაუდებელი მედიცინა',
        'ბავშვთა გასტროენტეროლოგია',
        'ბავშვთა ენდოკრინოლოგია',
        'ბავშვთა ინფექციური სნეულებები',
        'ბავშვთა კარდიოლოგია-რევმატოლოგია(ბავშვთა კარდიო-რევმატოლოგია)',
        'ბავშვთა ნევროლოგია',
        'ბავშვთა ნეფროლოგია',
        'ბავშვთა პულმონოლოგია',
        'ბავშვთა ტოქსიკოლოგია',
        'ბავშვთა  ფთიზიატრია',
        'ბავშვთა ფთიზიატრია-პულმონოლოგია',
        'ბავშთა ფსიქიატრია',
        'ბავშვთა ქირურგია',
        'ბავშვთა ქირურგიული სტომატოლოგია',
        'ბავშვთა თერაპიული სტომატოლოგია',
        'ბავშვთა ჰემატოლოგია-ტრანსფუზიოლოგია',
        'ნეონატოლოგია',
        'პედიატრია',
        'ზოგადი პროფილის ექიმი პედიატრი',
        'ბირთვული მედიცინა',
        'კლინიკური ონკოლოგია',
        'ონკოლოგია',
        'ონკოქირურგია',
        'რადიაციული თერაპია',
        'რადიაციული ონკოლოგია',
        'გასტროენტეროლოგია',
        'პროქტოლოგია',
        'დერმატო-ვენეროლოგია',
        'ენდოკრინოლოგია',
        'ზოგადი პროფილის ექიმი მკურნალი',
        'საოჯახო მედიცინა (ოჯახის ექიმი)',
        'ზოგადი პროფილის ექიმი პროფილაქტიკოსი',
        'ზოგადი პროფილის სამხედრო ექიმი',
        'შინაგანი მედიცინა (შინაგანი სნეულებები)',
        'ზოგადი პროფილის ექიმი სტომატოლოგი',
        'თერაპიული სტომატოლოგია',
        'ორთოდონტია',
        'ორთოპედიული სტომატოლოგია',
        'ქირურგიული სტომატოლოგია',
        'ზოგადი პროფილის ექიმი ლაბორანტი',
        'ლაბორატორიული მედიცინა',
        'სამედიცინო გენეტიკა',
        'ზოგადი ქირურგია',
        'ინფექციური სნეულებები',
        'სამედიცინო პარაზიტოლოგია',
        'კლინიკური ტოქსიკოლოგია',
        'კურორტოლოგია და ფიზიოთერაპია (ფიზიკური მედიცინა და კურორტოლოგია )',
        'სამკურნალო ფიზკულტირა და რეაბილიტაცია, სპორტული მედიცინა (სამედიცინო რეაბილიტაცია და სპორტის მედიცინა; სამედიცინო რეაბილიტაცია და სპორტული მედიცინა)',
        'სპორტის მედიცინა',
        'რევმატოლოგია',
        'ფიზიკური მედიცინა რეაბილიტაცია და კურორტოოგია',
        'ორთოპედია-ტრავატოლოგია (ტრავმატოლოგია-ორთოპედია)',
        'მეანობა-გინეკოლოგია (მეანობა-გინეკოლოგია და პერინატალური მედიცინა)',
        'რეპროდუქტოლოგია',
        'ფსიქიატრია',
        'ნარკოლოგია',
        'ნეიროქირურგია',
        'ნევროლოგია',
        'ოფთალმოლოგია',
        'ოტორინოლარინგოლოგია',
        'ყბა-სახის ქირურგია',
        'პლასტიკური და რეკონსტრუქციული ქირურგია (პლასტიკური ქირურგია)',
        'პათოლოგიური ანატომია, კლინიკური პათოლოგია',
        'სამედიცინო საციალური ექსპერტიზა',
        'სასამართო მედიცინა',
        'პულმონოლოგია',
        'ფთიზიატრია',
        'ფთიზიატრია-პულმონოლოგია',
        'ნეფროლოგია',
        'უროლოგია',
        'რადიოლოგია',
        'ჰემატოლოგია-ტრანსფუზიოლოგია (ტრანსფუზიოლოგია; ჰემატოლოგია)',
    ];

    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        foreach($this->doctorTypes as $doctorTypeName) {
            DoctorType::factory(1)->create()->each(function(DoctorType $doctorType) use($doctorTypeName){
                $transData = [];
                foreach(config('language_manager.locales') as $locale) {
                    $transData[$locale] = [
                        'title' => $doctorTypeName
                    ];
                }
                $doctorType->update($transData);
            });
        }
    }

}
